# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ipadd = input('Запросить у пользователя ввод IP-сети: ')

ip_template = ''' 
    Ip address:
    {0:<8}  {1:<8}  {2:<8}  {3:<8} 
    {0:08b}  {1:08b}  {2:08b}  {3:08b} 
    
    Mask:
    {4:<8}  {5:<8}  {6:<8}  {7:<8} 
    {4:08b}  {5:08b}  {6:08b}  {7:08b}
    
    Mask:
    {4:<8}  {5:<8}  {6:<8}  {7:<8} 
    {4:08b}  {5:08b}  {6:08b}  {7:08b}
    '''                                                                 

ip_str = ipadd.split('/')
ip_clear = ip_str[0].split('.')

a = int(ip_clear[0])
b = int(ip_clear[1])
c = int(ip_clear[2])
d = int(ip_clear[3])

limit = 2**32
wildmask = int(ip_str[1]) 
mask_clear = bin(limit - 2**wildmask)
finalmask = 32 - wildmask
lastmask = bin(limit - 2**finalmask)

q = int(lastmask[2:10],2)
w = int(lastmask[10:18],2)
e = int(lastmask[18:26],2)
r = int(lastmask[26:33],2)                 



print(ip_template.format(a, b, c, d, q, w, e ,r))
